Repository: OmegaT-L10N/es
Catalog: tm/Gnome localization/en-es.tmx
Source language: en
Languages: es

source: By default, Accerciser's main interface is comprised of three sections: a tree view of the entire desktop accessible hierarchy, namely Application Tree View, and two plugin areas. If you prefer to see all plugins in a single area, dividing Accerciser's interface in two sections instead of three, type ctrl +t. To re-divide it in three sections, just press ctrl+t again.
es: De manera predeterminada, la interfaz principal de Accerciser se compone de tres seccione: una vista en árbol de la jerarquía completa de accesibles del escritorio, llamada vista en árbol de la aplicación, y dos áreas de complementos. Si prefiere ver todos los complementos en una única área, divida la interfaz de Accerciser en dos secciones, en lugar de en tres, pulse ctrl +t. Para volver a dividirla en tres secciones, simplemente pulse ctrl +t otra vez.

source: Make sure that accessibility suport is enabled in your desktop - otherwise, Accerciser will not work as expected.
es: Asegúrese de que el soporte de accesibilidad está activado en su escritorio; si no lo está, Accerciser no funcionará como se espera.

source: Accerciser's default interface.
es: Interfaz predeterminada de Accerciser.

source: Accerciser's intended audience
es: Público objetivo de Accerciser

source: Accerciser fits the needs of many different audiences. User interface developers use it to ensure that their applications are providing all of their features through AT-SPI. Assistive technology developers are able to see what AT-SPI is providing to their applications. Automated UI test developers find Accerciser beneficial since it exposes different events that could be expected from their target application.
es: Accerciser se ajusta a las necesidades de diferentes públicos objetivo. Los desarrolladores de interfaces de usuario lo usan para asegurarse de que sus aplicaciones proporcionan todas sus características a través de At-SPI. Los desarrolladores de tecnologías de asistencia pueden ver qué proporciona AT-SPI a sus aplicaciones. Los desarrolladores de pruebas de IU automatizadas encuentra beneficioso a Accerciser ya que expone diferentes eventos que se podrían esperar de su aplicación objetivo.

source: Accerciser's plugin architecture
es: Arquitectura de complementos de Accerciser

source: Accerciser has an extensible, plugin-based architecture. Its core code is fairly small and most of its features are part of default plugins:
es: Accerciser tiene una arquitectura extensible basada en complementos. El núcleo de su código es bastante pequeño y la mayoría de sus características son parte de los complementos predeterminados:

source: Interface Viewer - A plugin that lets you explore the AT-SPI interfaces provided by each accessible widget of a target application.
es: Visor de interfaces: un complemento que le permite explorar las interfaces AT-SPI proporcionadas por cada widget accesible en una aplicación objetivo.

source: AT-SPI Validator - A plugin that applies tests to verify the accessibility of a target application.
es: Validador AT-SPI: un complemento que aplica pruebas para verificar la accesibilidad de una aplicación objetivo.

source: Event Monitor - A plugin that displays AT-SPI events emitted by a target application as they occur.
es: Monitor de eventos: un complemento que muestra eventos AT-SPI emitidos por una aplicación objetivo, según suceden.

source: Quick Select - A plugin that provides global hotkeys for quickly selecting accessible widgets in Accerciser's Application Tree View.
es: Selección rápida: Un complemento que proporciona teclas rápidas globales para seleccionar rápidamente widgets accesibles en la vista en árbol de la aplicación de Accerciser.

source: API Browser - A plugin that shows the interfaces, methods, and attributes available on each accessible widget of a target application.
es: Examinador API: un complemento que muestra las interfaces, métodos y atributos disponibles en cada widget accesible de una aplicación objetivo.

source: IPython Console - A plugin that provides a full, interactive Python shell with access to selected accessible widgets of a target application.
es: Consola IPython: un complemento que proporciona una shell Python completa e interactiva con acceso a los widgets accesibles seleccionados de una aplicación objetivo.

source: More about Accessibility
es: Más acerca de accesibilidad

source: Accessibility is a core value that should touch all aspects of a Desktop Environment. To help achieve it in GNOME, some libraries were developed, such as ATK and AT-SPI. Though originated in GNOME, these libraries are now also used in other Desktop Environments. To learn more about Accessibility Libraries for GNU/UNIX systems, you can consult:
es: La accesibilidad es un valor esencial que debe abarcar todos los aspectos de un entorno de escritorio. Para ayudar a lograrlo en GNOME, se han desarrollado algunas bibliotecas como ATK y AT-SPI. Aunque se crearon en GNOME, estas bibliotecas se usan también en otros entornos de escritorio. Para aprender más sobre bibliotecas de accesibilidad para sistemas GNU/Linux, puede consultar:

source: ATK Accessibility Toolkit - ATK provides the set of accessibility interfaces that are implemented by other toolkits and applications. Using the ATK interfaces, accessibility tools have full access to view and control running applications.
es: Kit de herramientas de accesibilidad ATK: ATK proporciona un conjunto de interfaces de accesibilidad implementadas por otros kits de herramientas y aplicaciones. Usando las interfaces ATK, las herramientas de accesibilidad tienen acceso completo para ver y controlar las aplicaciones en ejecución

source: AT-SPI - AT-SPI is the primary service interface by which assistive technologies query and receive notifications from running applications. Additional material is available from the KDE Accessibility Development Community.
es: AT-SPI: AT-SPI es la interfaz de servicio principal a la que consultan las tecnologías de asistencia y que recibe notificaciones de las aplicaciones en ejecución. Puede encontrar material adicional en la comunidad de desarrollo de accesibilidad de KDE.

source: GNOME Desktop Accessibility Guide - A guide for anyone interested in how the GNOME Desktop supports the needs of users with disabilities.
es: Guía de accesibilidad del escritorio GNOME: una guía para cualquiera que esté interesado en cómo soporta el escritorio GNOME las necesidades de usuarios con discapacidades.

source: GNOME Accessibility Developer's Guide - A guide for developers who want to ensure their applications are accessible to the widest audience of users.
es: Guía de accesibilidad para desarrolladores : una guía para desarrolladores que quieren asegurarse de que sus aplicaciones son accesibles para la mayor parte del público usuario.

source: GNOME Accessibility Project - The GNOME Accessibility Project includes the guides listed above along with many other useful links for users, developers and system administrators.
es: Proyecto de accesibilidad de GNOME: el proyecto de accesibilidad de GNOME incluye las guías mencionadas anteriormente junto con muchos otros enlaces útiles para usuarios, desarrolladores y administradores de sistemas.

source: 2. Interface Viewer Plugin
es: 2. Complemento Visor de interfaces

source: Examining your accessibility implementation
es: Examinar su implementación de accesibilidad

source: Interface Viewer Plugin
es: Complemento Visor de interfaces

source: The Interface Viewer Plugin shows the information and controls provided by the AT-SPI interfaces present in each accessible item from the Application Tree View. After selecting an item, you can use this plugin to quickly review its supported interfaces, to retrieve each interface's information, and to manipulate the item through all the interface’s methods.
es: El complemento «Visor de interfaces» muestra la información y los controles proporcionados por la interfaz AT-SPI presente en cada elemento accesible de la vista en árbol de la aplicación. Después de seleccionar un elemento, puede usar este complemento para revisar rápidamente sus interfaces soportadas, para obtener información sobre cada interfaz y para manipular el elemento mediante los métodos de la interfaz.

source: Examining a Menu with the Interface Viewer Plugin
es: Examinar un menú con el complemento «Visor de interfaces»

source: Given a selected item in the Application Tree View, all of its AT-SPI interfaces will be shown as sensitive in the Interface Viewer Plugin. Those unsupported will appear grayed out, such as the Application and Collection interfaces in the figure above.
es: Dado un elemento seleccionado en la vista en árbol de la aplicación, se mostrarán todas sus interfaces AT-SPI como sensitivas en el complemento de «Visor de interfaces». Aquellas no soportadas aparecerán en gris, tales como las interfaces de aplicación de recolección en la figura superior.

source: Running the Interface Viewer Plugin
es: Ejecutar el complemento Visor de interfaces

source: The first step to run the Interface Viewer Plugin is to select an item in the Application Tree View. After that, all AT-SPI interfaces covered by the plugin will be listed in the plugin's panel. The interfaces implemented by the selected item will be sensitive, so you can click each one of them to either retrieve their provided information or to interact with available methods. The following interfaces can be explored in Accerciser, assuming the selected item implements them:
es: El primer paso para ejecutar el complemento «Visor de interfaces» es seleccionar un elemento en la vista en árbol de la aplicación. Después de esto, todas las interfaces At-SPI cubiertas por el complemento se listarán en el panel de complementos. Las interfaces implementadas por el elemento seleccionado serán sensibles, por lo que podrá pulsar en cada una de ellas para obtener información o para interactuar con los métodos disponibles. Se pueden explorar las siguientes interfaces en Accerciser, asumiendo que el elemento seleccionado las implementa:

source: Accessible - This interface shows the selected item's child count (number of child widgets), description, states, relations, and attributes.
es: Accesible: esta interfaz muestra el contador de elementos hijos seleccionados (número de widgets hijos), descripción, estados, relaciones y atributos.

source: Action - This interface shows all the actions that can be performed by the selected item. For each interface, you will see its name, such as "press" or "click", followed by a description and a key binding, if there are any. If you select an action, a "Perform action" button will become sensitive. Press this button to see the item performing the selected action.
es: Acción: esta interfaz muestra todas las acciones que el elemento seleccionado se pueden realizar. Para cada interfaz verá su nombre, como «presionar» o «pulsar», seguido de una descripción y de una asociación de teclas, si hay alguna. si selecciona una acción, el botón «Realizar acción» se volverá sensible. Pulse este botón para ver al elemento realizar la acción seleccionada.

source: Application - This interface can be implemented by items with role "application". It is worth to point out that items with role "application" not necessarily implement this interface. If the selected item implements it, the interface will show its ID and, if there are any, its toolkit and version.
es: Aplicación: esta interfaz se puede implementar con elementos cuyo rol es «aplicación». Merece la pena señalar que los elementos cuyo rol es «aplicación» no necesariamente implementan esta interfaz. Si el elemento seleccionado la implementa, la interfaz mostrará su ID y, si tiene, su kit de herramientas y su versión.

source: Component - This interface shows the selected item's absolute position (with respect to the desktop coordinate system), relative position (with respect to the window coordinate system), size, layer type, MDI-Z-order (a short integer indicating the stacking order of the component in the MDI layer), and alpha (if alpha blending is used).
es: Componente: esta interfaz muestra la posición absoluta del elemento seleccionado (respecto del sistema de coordenadas del escritorio), posición relativa (respecto del sistema de coordenadas de la ventana), tamaño, tipo de capa, orden MDI-Z (un entero corto que indica el orden de apilamiento del componente en la capa MDI) y alfa (si se usa alfa).

source: Document - This interface shows the selected item's document attributes and locale description, if there is one.
es: Documento: esta interfaz muestra los atributos de documento del elemento seleccionado, así como la descripción regional, si existe.

source: Hypertext - This interface shows a list with all the selected item's hypertext hyperlinks. For each hyperlink, the interface provides its name, URI, start (the index in the hypertext at which the hyperlink begins) and end (the index in the hypertext at which this hyperlink ends).
es: Hipertexto: esta interfaz muestra una lista de todos los hiperenlaces de hipertexto de los elementos seleccionados. Para cada hiperenlace la interfaz proporciona su nombre, URI, inicio (el índice en el hipertexto en el que comienza el hiperenlace) y el final (el índice en el hipertexto en el que finaliza el hiperenlace).

source: Image - This interface shows the selected item's description (or "no description" if unspecified), size, position (with respect to the desktop coordinate system), and locale, if there is one.
es: Imagen: esta interfaz muestra la descripción del elemento seleccionado (o «sin descripción» si está sin especificar), tamaño, posición (respecto del sistema de coordenadas del escritorio), y configuración regional, si existe.

source: Selection - This interface shows all selectable child items of the selected item. If the selected item is a menu bar with options "File", "Edit", "View", and "Help", and all of them are selectable, then they will be listed in this interface. If you click a listed option - "File", for example - and want to clear it, just press the "Clear" button below the list.
es: Selección: esta interfaz muestra todos los elementos hijos seleccionables del elemento seleccionado. Si el elemento seleccionado es una barra de menú con las opciones «Archivo», «Editar», «Ver» y «Ayuda» y todas ellas se pueden seleccionar, entonces se listarán en esta interfaz. Si pulsa sobre una opción listada —«Archivo», por ejemplo— y quiere limpiarla, simplemente pulse el botón «Limpiar» en la lista de abajo.

source: Streamable Content - This interface shows the selected item's content types and their corresponding URIs.
es: Contenido secuenciable: esta interfaz muestra el tipo de contenido de los elementos seleccionados y sus URI correspondientes.

source: Table - This interface shows the selected item's caption and summary, rows (number of rows), columns (number of columns), selected rows (number of selected rows), and selected columns (number of selected columns). For a selected cell, the interface shows its row's and column's header and extents.
es: Tabla: esta interfaz muestra el título y el resumen del elemento seleccionado, filas (número de filas), columnas (número de columnas), filas seleccionadas (número de filas seleccionadas) y columnas seleccionadas (número de columnas seleccionadas). Para una celda seleccionada, la interfaz muestra la cabecera y extensión de sus filas y columnas.

source: Text - This interface shows the selected item's text content, that can be editable, and its attributes. The basic attributes are offset (the number of characters the text has) and justification. To see possible CSS attributes, click the "Include defaults" check box.
es: Texto: esta interfaz muestra el contenido de los elementos de texto del elemento, que pueden ser editables, y sus atributos. Los atributos básicos son el desplazamiento (el número de caracteres que tiene el texto) y su justificación. Para ver los posibles atributos de CSS, pulse en la casilla «incluir predeterminados».

source: Value - This interface shows the selected item's current value, minimum allowed value, maximum allowed value, and the minimum increment by which the value may be changed (or zero if this value cannot be determined). The current value can be manually changed via a spin button.
es: Valor: esta interfaz muestra el valor actual del elemento seleccionado, los valores mínimo y máximo permitidos y el incremento mínimo por el que el valor debe cambiar (o cero si este valor no se puede determinar). El valor actual se puede cambiar manualmente usando un botón incrementable.

source: Introduction to Accerciser
es: Introducción a Accerciser

source: Before You Begin
es: Antes de comenzar

source: Read the Universal Access Help
es: Lea la ayuda del acceso universal

source: Getting Started
es: Inicio

source: Examining the Accessibility of an Application
es: Examinar la accesibilidad de una aplicación

source: Advanced Topics
es: Temas avanzados

source: 3. Writing New Plugins
es: 3. Escribir complementos nuevos

source: Extending Accerciser with your desired functionalities
es: Ampliar Accerciser con nuevas funcionalidades

source: Writing Plugins for Accerciser
es: Escribir complementos para Accerciser

source: Extending Accerciser with new plugins became much simpler since this tutorial was written. Given that it provides a very detailed explanation about the topic, this section consists basically of its original content - only simple editions and updates were done.
es: Extender Accerciser con complementos nuevos se convirtió en algo muy sencillo desde que se escribió este tutorial. Proporcionar una explicación muy detallada sobre el tema; esta sección consta básicamente del contenido original (sólo se han hecho pequeñas ediciones y actualizaciones).

source: Accerciser supports three basic types of plugins:
es: Accerciser soporta tres tipos de complementos básicos:

source: Base plugins - These plugins are derived from the Plugin base class. They do not provide a visible interface, but could provide additional functionality to Accerciser.
es: Complementos base: estos complementos se derivan de la clase base «Plugin». No proporcionan una interfaz visible, pero pueden proporcionar funcionalidad adicional a Accerciser.

source: Console plugins - These plugins provide simple console output into a text area in a plugin tab. Not to be confused with the packaged IPython Console Plugin.
es: Complementos de consola: estos complementos proporcionan una sencilla consola de entrada en una área de texto en la pestaña de un complemento. No se confunda con el complemento de la Consola IPython incluido.

source: Viewport plugins - The majority of Accerciser default plugins. They provide a custom graphical interface in a tab.
es: Complementos visuales: la mayoría de los complementos predeterminados de Accerciser. Proporcionan una interfaz gráfica en una pestaña.

source: Creating a Base Plugin
es: Crear un complemento base

source: We will create a simplified version of the Quick Select Plugin. This plugin will select the last focused accessible when pressing ctrl+alt+e.
es: Se creará una versión simplificada del complemento de selección rápida. este complemento seleccionará el último accesible con el foco al pulsar ctrl+alt+e.

source: First off, the import lines we will use are:
es: Lo primero, las líneas de importación que se usarán son:

source: Next we will derive a new class from the Plugin base class, and assign some mandatory class attributes:
es: Lo siguiente será derivar una clase nueva de la clase base de complementos, y asignar algunos atributos obligatorios de clase:

source: We will now override the init method, in which we will set a global key action for selecting the last focused accessible item, register an event listener for the "focus" event, and set the last_focused instance variable to None.
es: Ahora se sobreescribirá el método «init», en el que se establecerá una acción de clave global para seleccionar el último elemento accesible con el foco, registrar un «listener» de eventos para el evento «focus», y establecer la variable de instancia last_focused a None.

source: Notice that the global_hotkeys instance variable is a list of tuples. Each tuple is a global hotkey action, composed by an action description, a desired method to call, a key symbol of keypress, and a key modifier mask.
es: Note que la variable de instancia global_hotkeys es una lista de tuplas. Cada tupla es una acción de tecla rápida global, compuesta por una descripción de la acción, un método al que llamar, un símbolo de tecla de pulsación y una máscara modificadora.

source: In the "focus" event callback, we assign the last_focused instance variable with the accessible item that has just emitted the "focus" event.
es: En el evento de retorno de llamada de «focus», se asigna la variable de instancia last_focused con el elemento accesible que acaba de emitir el evento «focus».

source: In the hotkey action callback, we update the application wide node with the last focused accessible item, if we have recorded it:
es: En el retorno de llamada de la acción de la tecla rápida se actualiza el nodo amplio de la aplicación con el último elemento que tuvo el foco, si se guardó:

source: Creating a Console Plugin
es: Crear un complemento de consola

source: We will create a console plugin to display focus changes emitted by an accessible item with a "push button" role - remember that it is easy to check what is the role of any item with Accerciser; you can verify it in the Application Tree View, for example.
es: Se creará un complemento de consola para mostrar los cambios de foco emitidos por un elemento accesible con un rol de «pulsar botón»; recuerde que es muy fácil comprobar el rol de cualquier elemento en Accerciser, puede comprobarlo en la vista en árbol de la aplicación, por ejemplo.

source: The needed import lines are:
es: Las líneas de importaciones necesarias son:

source: Then we add a class definition, with a plugin name and description:
es: Se añade entonces una definición de clase, con un nombre para el complemento y una descripción:

source: class PushButtonFocus(ConsolePlugin): plugin_name = 'Push Button Focus' plugin_description = 'Print event when pushbutton get\\'s focus.'
es: class PushButtonFocus(ConsolePlugin): plugin_name = 'Push Button Focus' plugin_description = 'Imprimir evento cuando el pulsador obtiene el foco.'

source: We override the init method adding a register listener:
es: Se sobreescribe el método «init» añadiendo un registro de «listener»:

source: In the callback method, all push button events are printed.
es: En el método de retorno de llamada se imprimen todos los eventos de pulsaciones de botones.

source: Creating a Viewport Plugin
es: Crear un complemento de punto de vista

source: We will create a viewport plugin that allows quick testing of the "click" action in accessible items that support the AT-SPI Action interface and have an action named "click". It will be a simple button that, once clicked, does the "click" action in the accessible.
es: Se creará un complemento de puerto de vista que permite una prueba rápida de la acción de pulsación sobre elementos accesibles que soportan la interfaz AT-SPI Action y tienen una acción llamada «click». Será un botón simple que, una vez pulsado, realiza la acción de pulsación sobre el accesible.

source: First off, some mandatory import lines:
es: En primer lugar, algunas líneas de importación obligatorias:

source: Next, a class definition, with a name and description:
es: Lo siguiente es una definición de clase, con un nombre y una descripción:
